tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# brew 'ack' # text search
# brew 'android-sdk' # android sdk and tools
brew 'awscli'
brew 'bash-completion'
brew 'bcrypt'
# brew 'calc' # calculator
# brew 'chamber'
# brew 'cmake'
# brew 'coreutils'
# brew 'findutils'
# brew 'freetype'
# brew 'fzf' # fuzzy search
brew 'git-crypt'
# brew 'gpg' # resource signer
# brew 'gradle' # android build system
# brew 'htop' # better top
brew 'httpie'
# brew 'hub'
# brew 'icu4c'
brew 'imagemagick'
# brew 'jpeg'
# brew 'jpegoptim' # optimise jpegs
# brew 'libevent'
# brew 'libpng'
# brew 'libtiff'
# brew 'libtool'
# brew 'micro' # terminal editor
brew 'mongodb'
# brew 'moreutils'
brew 'mysql'
brew 'node'
brew 'nodenv' # node version manager
brew 'openssl'
brew 'pkg-config'
brew 'postgresql'
brew 'qt'
brew 'rbenv' # ruby version manager
brew 'readline'
# brew 'reattach-to-user-namespace' # osx helper for tmux
brew 'redis'
brew 'ruby-build'
# brew 'terminal-notifier' # macos growl messages from terminal
# brew 'the_silver_searcher' # better ack: ag
# brew 'tmux' # terminal multiplexer
# brew 'tree' # directory tree view
# brew 'unrar' # unarchive rar files
# brew 'vim' # vim8
# brew 'watchman'
brew 'wget' # better curl
# brew 'xz'
brew 'yarn' # node package manager
brew 'youtube-dl' # download youtube vids
# brew 'z' # directory changer
cask '1password'
# cask 'amphetamine'
# cask 'android-studio'
# cask 'atom'
# cask 'avast'
# cask 'dash'
cask 'dropbox'
# cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
# cask 'kap'
# cask 'kindle'
# cask 'menubar-stats'
# cask 'micro-snitch'
# cask 'numi'
cask 'postman'
cask 'sequel-pro'
# cask 'sketch'
cask 'slack'
# cask 'sourcetree'
# cask 'spotify'
cask 'sublime-text'
# cask 'transmit'
cask 'vlc'
